Repository: nazmulkp/Big-camera-handle-iOS
Catalog: CameraAppSwiftUI/Resources/Permission.xcstrings
Source language: en
Languages: ar, de, es, fr, it, ja, ko, pt_br, ru, tr, zh_hans, zh_hant

# common.continue
source: Continue
ar: متابعة
de: Weiter
es: Continuar
fr: Continuer
it: Continua
ja: 続ける
ko: 계속
pt_br: Continuar
ru: Продолжить
tr: Devam Et
zh_hans: 继续
zh_hant: 繼續

# common.dismiss
source: Dismiss
ar: إغلاق
de: Schließen
es: Cerrar
fr: Fermer
it: Chiudi
ja: 閉じる
ko: 닫기
pt_br: Fechar
ru: Закрыть
tr: Kapat
zh_hans: 关闭
zh_hant: 關閉

# permission.camera.reason
source: Camera access is used to capture photos and videos with full manual controls.
ar: يُستخدم الوصول إلى الكاميرا لالتقاط الصور ومقاطع الفيديو مع تحكم يدوي كامل.
de: Der Kamerazugriff wird verwendet, um Fotos und Videos mit vollständiger manueller Steuerung aufzunehmen.
es: El acceso a la cámara se usa para capturar fotos y videos con controles manuales completos.
fr: L’accès à la caméra est utilisé pour capturer des photos et des vidéos avec des contrôles manuels complets.
it: L’accesso alla fotocamera viene utilizzato per scattare foto e registrare video con controlli manuali completi.
ja: カメラへのアクセスは、完全な手動コントロールで写真や動画を撮影するために使用されます。
ko: 카메라 접근 권한은 전체 수동 제어로 사진과 동영상을 촬영하는 데 사용됩니다.
pt_br: O acesso à câmera é usado para capturar fotos e vídeos com controles manuais completos.
ru: Доступ к камере используется для съемки фото и видео с полным ручным управлением.
tr: Kamera erişimi, tam manuel kontrollerle fotoğraf ve video çekmek için kullanılır.
zh_hans: 相机访问权限用于通过完整的手动控制拍摄照片和视频。
zh_hant: 相機存取權限用於透過完整的手動控制拍攝照片和影片。

# permission.error.camera_required
source: Camera access is required to capture photos and videos.
ar: يلزم الوصول إلى الكاميرا لالتقاط الصور ومقاطع الفيديو.
de: Der Kamerazugriff ist erforderlich, um Fotos und Videos aufzunehmen.
es: Se requiere acceso a la cámara para capturar fotos y videos.
fr: L’accès à la caméra est nécessaire pour capturer des photos et des vidéos.
it: L’accesso alla fotocamera è necessario per scattare foto e registrare video.
ja: 写真や動画を撮影するには、カメラへのアクセスが必要です。
ko: 사진과 동영상을 촬영하려면 카메라 접근 권한이 필요합니다.
pt_br: O acesso à câmera é necessário para capturar fotos e vídeos.
ru: Для съемки фото и видео требуется доступ к камере.
tr: Fotoğraf ve video çekmek için kamera erişimi gereklidir.
zh_hans: 需要相机访问权限才能拍摄照片和视频。
zh_hant: 需要相機存取權限才能拍攝照片和影片。

# permission.error.microphone_required
source: Microphone access is required to record audio with your videos.
ar: يلزم الوصول إلى الميكروفون لتسجيل الصوت مع مقاطع الفيديو.
de: Der Mikrofonzugriff ist erforderlich, um Audio mit deinen Videos aufzunehmen.
es: Se requiere acceso al micrófono para grabar audio con tus videos.
fr: L’accès au microphone est nécessaire pour enregistrer l’audio avec vos vidéos.
it: L’accesso al microfono è necessario per registrare l’audio con i tuoi video.
ja: 動画と一緒に音声を録音するには、マイクへのアクセスが必要です。
ko: 동영상에 오디오를 녹음하려면 마이크 접근 권한이 필요합니다.
pt_br: O acesso ao microfone é necessário para gravar áudio com seus vídeos.
ru: Для записи звука вместе с видео требуется доступ к микрофону.
tr: Videolarınızla birlikte ses kaydetmek için mikrofon erişimi gereklidir.
zh_hans: 需要麦克风访问权限才能为视频录制音频。
zh_hant: 需要麥克風存取權限才能為影片錄製音訊。

# permission.microphone.reason
source: Microphone access is used to record high-quality audio with your video footage.
ar: يُستخدم الوصول إلى الميكروفون لتسجيل صوت عالي الجودة مع لقطات الفيديو.
de: Der Mikrofonzugriff wird verwendet, um hochwertigen Ton mit deinen Videoaufnahmen aufzunehmen.
es: El acceso al micrófono se usa para grabar audio de alta calidad con tus videos.
fr: L’accès au microphone est utilisé pour enregistrer un son de haute qualité avec vos vidéos.
it: L’accesso al microfono viene utilizzato per registrare audio di alta qualità con i tuoi video.
ja: マイクへのアクセスは、動画に高品質な音声を録音するために使用されます。
ko: 마이크 접근 권한은 동영상에 고품질 오디오를 녹음하는 데 사용됩니다.
pt_br: O acesso ao microfone é usado para gravar áudio de alta qualidade com seus vídeos.
ru: Доступ к микрофону используется для записи качественного звука вместе с видео.
tr: Mikrofon erişimi, videolarınızla birlikte yüksek kaliteli ses kaydetmek için kullanılır.
zh_hans: 麦克风访问权限用于为视频录制高质量音频。
zh_hant: 麥克風存取權限用於為影片錄製高品質音訊。

# permission.needed.title
source: Permission Needed
ar: الإذن مطلوب
de: Berechtigung erforderlich
es: Permiso necesario
fr: Autorisation requise
it: Autorizzazione richiesta
ja: 許可が必要です
ko: 권한 필요
pt_br: Permissão necessária
ru: Требуется разрешение
tr: İzin Gerekli
zh_hans: 需要权限
zh_hant: 需要權限

# permission.open_settings
source: Open Settings
ar: فتح الإعدادات
de: Einstellungen öffnen
es: Abrir ajustes
fr: Ouvrir les réglages
it: Apri impostazioni
ja: 設定を開く
ko: 설정 열기
pt_br: Abrir Ajustes
ru: Открыть настройки
tr: Ayarları Aç
zh_hans: 打开设置
zh_hant: 開啟設定

# permission.privacy.message
source: Your photos and videos remain private on your device. We don’t access, upload, or store them.
ar: تبقى صورك ومقاطع الفيديو الخاصة بك على جهازك. نحن لا نصل إليها أو نرفعها أو نخزنها.
de: Deine Fotos und Videos bleiben privat auf deinem Gerät. Wir greifen nicht darauf zu, laden sie nicht hoch und speichern sie nicht.
es: Tus fotos y videos permanecen privados en tu dispositivo. No accedemos a ellos, no los subimos ni los almacenamos.
fr: Vos photos et vidéos restent privées sur votre appareil. Nous n’y accédons pas, ne les téléversons pas et ne les stockons pas.
it: Le tue foto e i tuoi video restano privati sul tuo dispositivo. Non li accediamo, carichiamo o archiviamo.
ja: 写真や動画はデバイス上で非公開のままです。当社がアクセス、アップロード、保存することはありません。
ko: 사진과 동영상은 기기에 비공개로 유지됩니다. 저희는 접근하거나 업로드하거나 저장하지 않습니다.
pt_br: Suas fotos e vídeos permanecem privados no seu dispositivo. Nós não acessamos, enviamos nem armazenamos esse conteúdo.
ru: Ваши фото и видео остаются приватными на вашем устройстве. Мы не получаем к ним доступ, не загружаем и не храним их.
tr: Fotoğraflarınız ve videolarınız cihazınızda gizli kalır. Bunlara erişmeyiz, yüklemeyiz veya saklamayız.
zh_hans: 你的照片和视频会保留在设备上并保持私密。我们不会访问、上传或存储它们。
zh_hant: 你的照片和影片會保留在裝置上並保持私密。我們不會存取、上傳或儲存它們。

# permission.requesting
source: Requesting Permissions…
ar: جارٍ طلب الأذونات…
de: Berechtigungen werden angefragt…
es: Solicitando permisos…
fr: Demande d’autorisations…
it: Richiesta autorizzazioni…
ja: 許可をリクエスト中…
ko: 권한 요청 중…
pt_br: Solicitando permissões…
ru: Запрос разрешений…
tr: İzinler isteniyor…
zh_hans: 正在请求权限…
zh_hant: 正在請求權限…

# permission.settings.helper
source: You can enable Camera & Microphone access anytime from iOS Settings.
ar: يمكنك تفعيل الوصول إلى الكاميرا والميكروفون في أي وقت من إعدادات iOS.
de: Du kannst den Zugriff auf Kamera und Mikrofon jederzeit in den iOS-Einstellungen aktivieren.
es: Puedes activar el acceso a la cámara y al micrófono en cualquier momento desde los ajustes de iOS.
fr: Vous pouvez activer l’accès à la caméra et au microphone à tout moment depuis les réglages iOS.
it: Puoi abilitare l’accesso a fotocamera e microfono in qualsiasi momento dalle impostazioni di iOS.
ja: カメラとマイクへのアクセスは、いつでもiOSの設定から有効にできます。
ko: 카메라 및 마이크 접근 권한은 언제든지 iOS 설정에서 활성화할 수 있습니다.
pt_br: Você pode ativar o acesso à câmera e ao microfone a qualquer momento nos Ajustes do iOS.
ru: Вы можете включить доступ к камере и микрофону в любое время в настройках iOS.
tr: Kamera ve Mikrofon erişimini istediğiniz zaman iOS Ayarları’ndan etkinleştirebilirsiniz.
zh_hans: 你可以随时在 iOS 设置中启用相机和麦克风访问权限。
zh_hant: 你可以隨時在 iOS 設定中啟用相機和麥克風存取權限。

# permission.subtitle
source: To start shooting with Easy Pro Camera, the app needs access to your camera and microphone.
ar: لبدء التصوير باستخدام Easy Pro Camera، يحتاج التطبيق إلى الوصول إلى الكاميرا والميكروفون.
de: Um mit Easy Pro Camera aufzunehmen, benötigt die App Zugriff auf deine Kamera und dein Mikrofon.
es: Para empezar a capturar con Easy Pro Camera, la app necesita acceso a tu cámara y micrófono.
fr: Pour commencer à filmer avec Easy Pro Camera, l’app a besoin d’accéder à votre caméra et à votre microphone.
it: Per iniziare a scattare con Easy Pro Camera, l’app deve accedere alla fotocamera e al microfono.
ja: Easy Pro Cameraで撮影を開始するには、アプリがカメラとマイクにアクセスする必要があります。
ko: Easy Pro Camera로 촬영을 시작하려면 앱이 카메라와 마이크에 접근해야 합니다.
pt_br: Para começar a fotografar com o Easy Pro Camera, o app precisa acessar sua câmera e seu microfone.
ru: Чтобы начать съемку в Easy Pro Camera, приложению нужен доступ к вашей камере и микрофону.
tr: Easy Pro Camera ile çekime başlamak için uygulamanın kameranıza ve mikrofonunuza erişmesi gerekir.
zh_hans: 要开始使用 Easy Pro Camera 拍摄，App 需要访问你的相机和麦克风。
zh_hant: 若要開始使用 Easy Pro Camera 拍攝，App 需要存取你的相機和麥克風。

# permission.success.message
source: Thanks for downloading Easy Pro Camera! Enjoy capturing your favorite moments, and help us improve by sharing your experience through ratings, reviews, or messages. Reach out anytime if you have issues or feature ideas.
ar: شكرًا لتنزيل Easy Pro Camera! استمتع بالتقاط لحظاتك المفضلة، وساعدنا على التحسين من خلال مشاركة تجربتك عبر التقييمات أو المراجعات أو الرسائل. تواصل معنا في أي وقت إذا واجهت مشكلة أو كانت لديك أفكار لميزات جديدة.
de: Danke, dass du Easy Pro Camera heruntergeladen hast! Viel Spaß beim Festhalten deiner Lieblingsmomente. Hilf uns, besser zu werden, indem du deine Erfahrung über Bewertungen, Rezensionen oder Nachrichten teilst. Melde dich jederzeit, wenn du Probleme hast oder Ideen für neue Funktionen.
es: ¡Gracias por descargar Easy Pro Camera! Disfruta capturando tus momentos favoritos y ayúdanos a mejorar compartiendo tu experiencia con calificaciones, reseñas o mensajes. Contáctanos cuando quieras si tienes problemas o ideas para nuevas funciones.
fr: Merci d’avoir téléchargé Easy Pro Camera ! Profitez de la capture de vos moments préférés et aidez-nous à nous améliorer en partageant votre expérience avec des notes, des avis ou des messages. Contactez-nous à tout moment si vous rencontrez un problème ou avez des idées de fonctionnalités.
it: Grazie per aver scaricato Easy Pro Camera! Divertiti a catturare i tuoi momenti preferiti e aiutaci a migliorare condividendo la tua esperienza con valutazioni, recensioni o messaggi. Contattaci in qualsiasi momento se hai problemi o idee per nuove funzionalità.
ja: Easy Pro Cameraをダウンロードしていただきありがとうございます！お気に入りの瞬間を撮影してお楽しみください。評価、レビュー、メッセージで体験を共有して、アプリ改善にご協力ください。問題や機能のアイデアがあれば、いつでもご連絡ください。
ko: Easy Pro Camera를 다운로드해 주셔서 감사합니다! 소중한 순간을 즐겁게 촬영하시고, 평점, 리뷰 또는 메시지로 경험을 공유해 앱 개선에 도움을 주세요. 문제가 있거나 새로운 기능 아이디어가 있다면 언제든지 연락해 주세요.
pt_br: Obrigado por baixar o Easy Pro Camera! Aproveite para capturar seus momentos favoritos e nos ajude a melhorar compartilhando sua experiência por meio de avaliações, comentários ou mensagens. Entre em contato a qualquer momento se tiver problemas ou ideias de recursos.
ru: Спасибо, что скачали Easy Pro Camera! Наслаждайтесь съемкой любимых моментов и помогайте нам становиться лучше, делясь своим опытом через оценки, отзывы или сообщения. Обращайтесь в любое время, если возникнут проблемы или появятся идеи для новых функций.
tr: Easy Pro Camera’yı indirdiğiniz için teşekkürler! En sevdiğiniz anları yakalamanın keyfini çıkarın ve puanlar, yorumlar veya mesajlar yoluyla deneyiminizi paylaşarak gelişmemize yardımcı olun. Sorun yaşarsanız veya özellik fikirleriniz varsa bize istediğiniz zaman ulaşın.
zh_hans: 感谢下载 Easy Pro Camera！尽情记录你喜爱的瞬间，并通过评分、评论或消息分享你的体验，帮助我们不断改进。如果遇到问题或有新功能想法，欢迎随时联系我们。
zh_hant: 感謝下載 Easy Pro Camera！盡情記錄你喜愛的瞬間，並透過評分、評論或訊息分享你的體驗，協助我們持續改進。如果遇到問題或有新功能想法，歡迎隨時聯絡我們。

# permission.title
source: Your Camera, Your Looks, Your Way.
ar: كاميرتك، إطلالتك، بطريقتك.
de: Deine Kamera, dein Look, dein Stil.
es: Tu cámara, tu estilo, a tu manera.
fr: Votre caméra, votre style, à votre façon.
it: La tua fotocamera, il tuo stile, a modo tuo.
ja: あなたのカメラ、あなたの見せ方、あなたらしく。
ko: 당신의 카메라, 당신의 스타일, 당신의 방식.
pt_br: Sua câmera, seu estilo, do seu jeito.
ru: Ваша камера, ваш образ, ваш стиль.
tr: Kameranız, tarzınız, sizin yolunuz.
zh_hans: 你的相机，你的风格，你的方式。
zh_hant: 你的相機，你的風格，你的方式。
